/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals, dead_code, non_camel_case_types)]

pub const FB_API_VER: u32 = 30;
pub const ISC_TRUE: u32 = 1;
pub const ISC_FALSE: u32 = 0;
pub const ISC__TRUE: u32 = 1;
pub const ISC__FALSE: u32 = 0;
pub const _INTTYPES_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 26;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;

pub const isc_nbackup_unknown_switch: u32 = 337117216;
pub const isc_nbackup_nofetchpw_svc: u32 = 337117217;
pub const isc_nbackup_pwfile_error: u32 = 337117218;
pub const isc_nbackup_size_with_lock: u32 = 337117219;
pub const isc_nbackup_no_switch: u32 = 337117220;
pub const isc_nbackup_err_read: u32 = 337117223;
pub const isc_nbackup_err_write: u32 = 337117224;
pub const isc_nbackup_err_seek: u32 = 337117225;
pub const isc_nbackup_err_opendb: u32 = 337117226;
pub const isc_nbackup_err_fadvice: u32 = 337117227;
pub const isc_nbackup_err_createdb: u32 = 337117228;
pub const isc_nbackup_err_openbk: u32 = 337117229;
pub const isc_nbackup_err_createbk: u32 = 337117230;
pub const isc_nbackup_err_eofdb: u32 = 337117231;
pub const isc_nbackup_fixup_wrongstate: u32 = 337117232;
pub const isc_nbackup_err_db: u32 = 337117233;
pub const isc_nbackup_userpw_toolong: u32 = 337117234;
pub const isc_nbackup_lostrec_db: u32 = 337117235;
pub const isc_nbackup_lostguid_db: u32 = 337117236;
pub const isc_nbackup_err_eofhdrdb: u32 = 337117237;
pub const isc_nbackup_db_notlock: u32 = 337117238;
pub const isc_nbackup_lostguid_bk: u32 = 337117239;
pub const isc_nbackup_page_changed: u32 = 337117240;
pub const isc_nbackup_dbsize_inconsistent: u32 = 337117241;
pub const isc_nbackup_failed_lzbk: u32 = 337117242;
pub const isc_nbackup_err_eofhdrbk: u32 = 337117243;
pub const isc_nbackup_invalid_incbk: u32 = 337117244;
pub const isc_nbackup_unsupvers_incbk: u32 = 337117245;
pub const isc_nbackup_invlevel_incbk: u32 = 337117246;
pub const isc_nbackup_wrong_orderbk: u32 = 337117247;
pub const isc_nbackup_err_eofbk: u32 = 337117248;
pub const isc_nbackup_err_copy: u32 = 337117249;
pub const isc_nbackup_err_eofhdr_restdb: u32 = 337117250;
pub const isc_nbackup_lostguid_l0bk: u32 = 337117251;
pub const isc_nbackup_switchd_parameter: u32 = 337117255;
pub const isc_nbackup_user_stop: u32 = 337117257;
pub const isc_nbackup_deco_parse: u32 = 337117259;
pub const isc_trace_conflict_acts: u32 = 337182750;
pub const isc_trace_act_notfound: u32 = 337182751;
pub const isc_trace_switch_once: u32 = 337182752;
pub const isc_trace_param_val_miss: u32 = 337182753;
pub const isc_trace_param_invalid: u32 = 337182754;
pub const isc_trace_switch_unknown: u32 = 337182755;
pub const isc_trace_switch_svc_only: u32 = 337182756;
pub const isc_trace_switch_user_only: u32 = 337182757;
pub const isc_trace_switch_param_miss: u32 = 337182758;
pub const isc_trace_param_act_notcompat: u32 = 337182759;
pub const isc_trace_mandatory_switch_miss: u32 = 337182760;
pub const isc_err_max: u32 = 1259;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type FB_API_HANDLE = ::std::os::raw::c_uint;
pub type FB_SIZE_T = ::std::os::raw::c_uint;
pub type FB_SSIZE_T = ::std::os::raw::c_int;
pub type ISC_STATUS = isize;
pub type ISC_STATUS_ARRAY = [ISC_STATUS; 20usize];
pub type FB_SQLSTATE_STRING = [::std::os::raw::c_char; 6usize];
pub type ISC_LONG = ::std::os::raw::c_int;
pub type ISC_ULONG = ::std::os::raw::c_uint;
pub type ISC_SHORT = ::std::os::raw::c_short;
pub type ISC_USHORT = ::std::os::raw::c_ushort;
pub type ISC_UCHAR = ::std::os::raw::c_uchar;
pub type ISC_SCHAR = ::std::os::raw::c_char;
pub type FB_BOOLEAN = ISC_UCHAR;
pub type ISC_INT64 = ::std::os::raw::c_longlong;
pub type ISC_UINT64 = ::std::os::raw::c_ulonglong;
pub type ISC_DATE = ::std::os::raw::c_int;
pub type ISC_TIME = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISC_TIMESTAMP {
    pub timestamp_date: ISC_DATE,
    pub timestamp_time: ISC_TIME,
}
#[test]
fn bindgen_test_layout_ISC_TIMESTAMP() {
    assert_eq!(
        ::std::mem::size_of::<ISC_TIMESTAMP>(),
        8usize,
        concat!("Size of: ", stringify!(ISC_TIMESTAMP))
    );
    assert_eq!(
        ::std::mem::align_of::<ISC_TIMESTAMP>(),
        4usize,
        concat!("Alignment of ", stringify!(ISC_TIMESTAMP))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_TIMESTAMP>())).timestamp_date as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_TIMESTAMP),
            "::",
            stringify!(timestamp_date)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_TIMESTAMP>())).timestamp_time as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_TIMESTAMP),
            "::",
            stringify!(timestamp_time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GDS_QUAD_t {
    pub gds_quad_high: ISC_LONG,
    pub gds_quad_low: ISC_ULONG,
}
#[test]
fn bindgen_test_layout_GDS_QUAD_t() {
    assert_eq!(
        ::std::mem::size_of::<GDS_QUAD_t>(),
        8usize,
        concat!("Size of: ", stringify!(GDS_QUAD_t))
    );
    assert_eq!(
        ::std::mem::align_of::<GDS_QUAD_t>(),
        4usize,
        concat!("Alignment of ", stringify!(GDS_QUAD_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GDS_QUAD_t>())).gds_quad_high as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GDS_QUAD_t),
            "::",
            stringify!(gds_quad_high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GDS_QUAD_t>())).gds_quad_low as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GDS_QUAD_t),
            "::",
            stringify!(gds_quad_low)
        )
    );
}
pub type GDS_QUAD = GDS_QUAD_t;
pub type ISC_QUAD = GDS_QUAD_t;
pub type FB_SHUTDOWN_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        reason: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type isc_att_handle = FB_API_HANDLE;
pub type isc_blob_handle = FB_API_HANDLE;
pub type isc_db_handle = FB_API_HANDLE;
pub type isc_req_handle = FB_API_HANDLE;
pub type isc_stmt_handle = FB_API_HANDLE;
pub type isc_svc_handle = FB_API_HANDLE;
pub type isc_tr_handle = FB_API_HANDLE;
pub type isc_callback = ::std::option::Option<unsafe extern "C" fn()>;
pub type isc_resv_handle = ISC_LONG;
pub type ISC_PRINT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ISC_SHORT,
        arg3: *const ::std::os::raw::c_char,
    ),
>;
pub type ISC_VERSION_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *const ::std::os::raw::c_char),
>;
pub type ISC_EVENT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ISC_USHORT,
        arg3: *const ISC_UCHAR,
    ),
>;
pub type GDS__QUAD = GDS_QUAD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISC_ARRAY_BOUND {
    pub array_bound_lower: ::std::os::raw::c_short,
    pub array_bound_upper: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_ISC_ARRAY_BOUND() {
    assert_eq!(
        ::std::mem::size_of::<ISC_ARRAY_BOUND>(),
        4usize,
        concat!("Size of: ", stringify!(ISC_ARRAY_BOUND))
    );
    assert_eq!(
        ::std::mem::align_of::<ISC_ARRAY_BOUND>(),
        2usize,
        concat!("Alignment of ", stringify!(ISC_ARRAY_BOUND))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_BOUND>())).array_bound_lower as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_BOUND),
            "::",
            stringify!(array_bound_lower)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_BOUND>())).array_bound_upper as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_BOUND),
            "::",
            stringify!(array_bound_upper)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISC_ARRAY_DESC {
    pub array_desc_dtype: ISC_UCHAR,
    pub array_desc_scale: ISC_SCHAR,
    pub array_desc_length: ::std::os::raw::c_ushort,
    pub array_desc_field_name: [ISC_SCHAR; 32usize],
    pub array_desc_relation_name: [ISC_SCHAR; 32usize],
    pub array_desc_dimensions: ::std::os::raw::c_short,
    pub array_desc_flags: ::std::os::raw::c_short,
    pub array_desc_bounds: [ISC_ARRAY_BOUND; 16usize],
}
#[test]
fn bindgen_test_layout_ISC_ARRAY_DESC() {
    assert_eq!(
        ::std::mem::size_of::<ISC_ARRAY_DESC>(),
        136usize,
        concat!("Size of: ", stringify!(ISC_ARRAY_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<ISC_ARRAY_DESC>(),
        2usize,
        concat!("Alignment of ", stringify!(ISC_ARRAY_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_dtype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_scale as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_scale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_length as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_field_name as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_field_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_relation_name as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_relation_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_dimensions as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_dimensions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_flags as *const _ as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_ARRAY_DESC>())).array_desc_bounds as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_ARRAY_DESC),
            "::",
            stringify!(array_desc_bounds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISC_BLOB_DESC {
    pub blob_desc_subtype: ::std::os::raw::c_short,
    pub blob_desc_charset: ::std::os::raw::c_short,
    pub blob_desc_segment_size: ::std::os::raw::c_short,
    pub blob_desc_field_name: [ISC_UCHAR; 32usize],
    pub blob_desc_relation_name: [ISC_UCHAR; 32usize],
}
#[test]
fn bindgen_test_layout_ISC_BLOB_DESC() {
    assert_eq!(
        ::std::mem::size_of::<ISC_BLOB_DESC>(),
        70usize,
        concat!("Size of: ", stringify!(ISC_BLOB_DESC))
    );
    assert_eq!(
        ::std::mem::align_of::<ISC_BLOB_DESC>(),
        2usize,
        concat!("Alignment of ", stringify!(ISC_BLOB_DESC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_BLOB_DESC>())).blob_desc_subtype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_BLOB_DESC),
            "::",
            stringify!(blob_desc_subtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ISC_BLOB_DESC>())).blob_desc_charset as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_BLOB_DESC),
            "::",
            stringify!(blob_desc_charset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_BLOB_DESC>())).blob_desc_segment_size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_BLOB_DESC),
            "::",
            stringify!(blob_desc_segment_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_BLOB_DESC>())).blob_desc_field_name as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_BLOB_DESC),
            "::",
            stringify!(blob_desc_field_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ISC_BLOB_DESC>())).blob_desc_relation_name as *const _ as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ISC_BLOB_DESC),
            "::",
            stringify!(blob_desc_relation_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct isc_blob_ctl {
    pub ctl_source: ::std::option::Option<unsafe extern "C" fn() -> ISC_STATUS>,
    pub ctl_source_handle: *mut isc_blob_ctl,
    pub ctl_to_sub_type: ::std::os::raw::c_short,
    pub ctl_from_sub_type: ::std::os::raw::c_short,
    pub ctl_buffer_length: ::std::os::raw::c_ushort,
    pub ctl_segment_length: ::std::os::raw::c_ushort,
    pub ctl_bpb_length: ::std::os::raw::c_ushort,
    pub ctl_bpb: *mut ISC_SCHAR,
    pub ctl_buffer: *mut ISC_UCHAR,
    pub ctl_max_segment: ISC_LONG,
    pub ctl_number_segments: ISC_LONG,
    pub ctl_total_length: ISC_LONG,
    pub ctl_status: *mut ISC_STATUS,
    pub ctl_data: [::std::os::raw::c_long; 8usize],
}
#[test]
fn bindgen_test_layout_isc_blob_ctl() {
    assert_eq!(
        ::std::mem::size_of::<isc_blob_ctl>(),
        136usize,
        concat!("Size of: ", stringify!(isc_blob_ctl))
    );
    assert_eq!(
        ::std::mem::align_of::<isc_blob_ctl>(),
        8usize,
        concat!("Alignment of ", stringify!(isc_blob_ctl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_source as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_source_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_source_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_to_sub_type as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_to_sub_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_from_sub_type as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_from_sub_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_buffer_length as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_buffer_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_segment_length as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_segment_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_bpb_length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_bpb_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_bpb as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_bpb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_buffer as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_max_segment as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_max_segment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_number_segments as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_number_segments)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_total_length as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_total_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_status as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<isc_blob_ctl>())).ctl_data as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(isc_blob_ctl),
            "::",
            stringify!(ctl_data)
        )
    );
}
pub type ISC_BLOB_CTL = *mut isc_blob_ctl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bstream {
    pub bstr_blob: isc_blob_handle,
    pub bstr_buffer: *mut ISC_SCHAR,
    pub bstr_ptr: *mut ISC_SCHAR,
    pub bstr_length: ::std::os::raw::c_short,
    pub bstr_cnt: ::std::os::raw::c_short,
    pub bstr_mode: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_bstream() {
    assert_eq!(
        ::std::mem::size_of::<bstream>(),
        32usize,
        concat!("Size of: ", stringify!(bstream))
    );
    assert_eq!(
        ::std::mem::align_of::<bstream>(),
        8usize,
        concat!("Alignment of ", stringify!(bstream))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_blob as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_blob)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_buffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_ptr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_cnt as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bstream>())).bstr_mode as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bstream),
            "::",
            stringify!(bstr_mode)
        )
    );
}
pub type BSTREAM = bstream;
pub type FB_BLOB_STREAM = *mut bstream;
pub const blob_lseek_mode_blb_seek_relative: blob_lseek_mode = 1;
pub const blob_lseek_mode_blb_seek_from_tail: blob_lseek_mode = 2;
pub type blob_lseek_mode = u32;
pub const blob_get_result_blb_got_fragment: blob_get_result = -1;
pub const blob_get_result_blb_got_eof: blob_get_result = 0;
pub const blob_get_result_blb_got_full_segment: blob_get_result = 1;
pub type blob_get_result = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blobcallback {
    pub blob_get_segment: ::std::option::Option<
        unsafe extern "C" fn(
            hnd: *mut ::std::os::raw::c_void,
            buffer: *mut ISC_UCHAR,
            buf_size: ISC_USHORT,
            result_len: *mut ISC_USHORT,
        ) -> ::std::os::raw::c_short,
    >,
    pub blob_handle: *mut ::std::os::raw::c_void,
    pub blob_number_segments: ISC_LONG,
    pub blob_max_segment: ISC_LONG,
    pub blob_total_length: ISC_LONG,
    pub blob_put_segment: ::std::option::Option<
        unsafe extern "C" fn(
            hnd: *mut ::std::os::raw::c_void,
            buffer: *const ISC_UCHAR,
            buf_size: ISC_USHORT,
        ),
    >,
    pub blob_lseek: ::std::option::Option<
        unsafe extern "C" fn(
            hnd: *mut ::std::os::raw::c_void,
            mode: ISC_USHORT,
            offset: ISC_LONG,
        ) -> ISC_LONG,
    >,
}
#[test]
fn bindgen_test_layout_blobcallback() {
    assert_eq!(
        ::std::mem::size_of::<blobcallback>(),
        48usize,
        concat!("Size of: ", stringify!(blobcallback))
    );
    assert_eq!(
        ::std::mem::align_of::<blobcallback>(),
        8usize,
        concat!("Alignment of ", stringify!(blobcallback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_get_segment as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_get_segment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blobcallback>())).blob_number_segments as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_number_segments)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_max_segment as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_max_segment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_total_length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_total_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_put_segment as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_put_segment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobcallback>())).blob_lseek as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(blobcallback),
            "::",
            stringify!(blob_lseek)
        )
    );
}
pub type BLOBCALLBACK = *mut blobcallback;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct paramdsc {
    pub dsc_dtype: ISC_UCHAR,
    pub dsc_scale: ::std::os::raw::c_schar,
    pub dsc_length: ISC_USHORT,
    pub dsc_sub_type: ::std::os::raw::c_short,
    pub dsc_flags: ISC_USHORT,
    pub dsc_address: *mut ISC_UCHAR,
}
#[test]
fn bindgen_test_layout_paramdsc() {
    assert_eq!(
        ::std::mem::size_of::<paramdsc>(),
        16usize,
        concat!("Size of: ", stringify!(paramdsc))
    );
    assert_eq!(
        ::std::mem::align_of::<paramdsc>(),
        8usize,
        concat!("Alignment of ", stringify!(paramdsc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_dtype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_scale as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_length as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_sub_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_sub_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_flags as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramdsc>())).dsc_address as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(paramdsc),
            "::",
            stringify!(dsc_address)
        )
    );
}
pub type PARAMDSC = paramdsc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct paramvary {
    pub vary_length: ISC_USHORT,
    pub vary_string: [ISC_UCHAR; 1usize],
}
#[test]
fn bindgen_test_layout_paramvary() {
    assert_eq!(
        ::std::mem::size_of::<paramvary>(),
        4usize,
        concat!("Size of: ", stringify!(paramvary))
    );
    assert_eq!(
        ::std::mem::align_of::<paramvary>(),
        2usize,
        concat!("Alignment of ", stringify!(paramvary))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramvary>())).vary_length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(paramvary),
            "::",
            stringify!(vary_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<paramvary>())).vary_string as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(paramvary),
            "::",
            stringify!(vary_string)
        )
    );
}
pub type PARAMVARY = paramvary;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSQLVAR {
    pub sqltype: ISC_SHORT,
    pub sqlscale: ISC_SHORT,
    pub sqlsubtype: ISC_SHORT,
    pub sqllen: ISC_SHORT,
    pub sqldata: *mut ISC_SCHAR,
    pub sqlind: *mut ISC_SHORT,
    pub sqlname_length: ISC_SHORT,
    pub sqlname: [ISC_SCHAR; 32usize],
    pub relname_length: ISC_SHORT,
    pub relname: [ISC_SCHAR; 32usize],
    pub ownname_length: ISC_SHORT,
    pub ownname: [ISC_SCHAR; 32usize],
    pub aliasname_length: ISC_SHORT,
    pub aliasname: [ISC_SCHAR; 32usize],
}
#[test]
fn bindgen_test_layout_XSQLVAR() {
    assert_eq!(
        ::std::mem::size_of::<XSQLVAR>(),
        160usize,
        concat!("Size of: ", stringify!(XSQLVAR))
    );
    assert_eq!(
        ::std::mem::align_of::<XSQLVAR>(),
        8usize,
        concat!("Alignment of ", stringify!(XSQLVAR))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqltype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqltype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqlscale as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqlscale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqlsubtype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqlsubtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqllen as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqllen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqldata as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqldata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqlind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqlind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqlname_length as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqlname_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).sqlname as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(sqlname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).relname_length as *const _ as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(relname_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).relname as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(relname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).ownname_length as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(ownname_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).ownname as *const _ as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(ownname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).aliasname_length as *const _ as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(aliasname_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLVAR>())).aliasname as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLVAR),
            "::",
            stringify!(aliasname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSQLDA {
    pub version: ISC_SHORT,
    pub sqldaid: [ISC_SCHAR; 8usize],
    pub sqldabc: ISC_LONG,
    pub sqln: ISC_SHORT,
    pub sqld: ISC_SHORT,
    pub sqlvar: [XSQLVAR; 1usize],
}
#[test]
fn bindgen_test_layout_XSQLDA() {
    assert_eq!(
        ::std::mem::size_of::<XSQLDA>(),
        184usize,
        concat!("Size of: ", stringify!(XSQLDA))
    );
    assert_eq!(
        ::std::mem::align_of::<XSQLDA>(),
        8usize,
        concat!("Alignment of ", stringify!(XSQLDA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).sqldaid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(sqldaid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).sqldabc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(sqldabc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).sqln as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(sqln)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).sqld as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(sqld)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XSQLDA>())).sqlvar as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XSQLDA),
            "::",
            stringify!(sqlvar)
        )
    );
}
extern "C" {
    pub fn isc_attach_database(
        arg1: *mut ISC_STATUS_ARRAY,
        arg2: ::std::os::raw::c_short,
        arg3: *const ISC_SCHAR,
        arg4: *mut isc_db_handle,
        arg5: ::std::os::raw::c_short,
        arg6: *const ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_gen_sdl(
        arg1: *mut ISC_STATUS,
        arg2: *const ISC_ARRAY_DESC,
        arg3: *mut ISC_SHORT,
        arg4: *mut ISC_UCHAR,
        arg5: *mut ISC_SHORT,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_get_slice(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut ISC_QUAD,
        arg5: *const ISC_ARRAY_DESC,
        arg6: *mut ::std::os::raw::c_void,
        arg7: *mut ISC_LONG,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_lookup_bounds(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *const ISC_SCHAR,
        arg5: *const ISC_SCHAR,
        arg6: *mut ISC_ARRAY_DESC,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_lookup_desc(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *const ISC_SCHAR,
        arg5: *const ISC_SCHAR,
        arg6: *mut ISC_ARRAY_DESC,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_set_desc(
        arg1: *mut ISC_STATUS,
        arg2: *const ISC_SCHAR,
        arg3: *const ISC_SCHAR,
        arg4: *const ::std::os::raw::c_short,
        arg5: *const ::std::os::raw::c_short,
        arg6: *const ::std::os::raw::c_short,
        arg7: *mut ISC_ARRAY_DESC,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_array_put_slice(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut ISC_QUAD,
        arg5: *const ISC_ARRAY_DESC,
        arg6: *mut ::std::os::raw::c_void,
        arg7: *mut ISC_LONG,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_blob_default_desc(
        arg1: *mut ISC_BLOB_DESC,
        arg2: *const ISC_UCHAR,
        arg3: *const ISC_UCHAR,
    );
}
extern "C" {
    pub fn isc_blob_gen_bpb(
        arg1: *mut ISC_STATUS,
        arg2: *const ISC_BLOB_DESC,
        arg3: *const ISC_BLOB_DESC,
        arg4: ::std::os::raw::c_ushort,
        arg5: *mut ISC_UCHAR,
        arg6: *mut ::std::os::raw::c_ushort,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_blob_info(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_blob_handle,
        arg3: ::std::os::raw::c_short,
        arg4: *const ISC_SCHAR,
        arg5: ::std::os::raw::c_short,
        arg6: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_blob_lookup_desc(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *const ISC_UCHAR,
        arg5: *const ISC_UCHAR,
        arg6: *mut ISC_BLOB_DESC,
        arg7: *mut ISC_UCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_blob_set_desc(
        arg1: *mut ISC_STATUS,
        arg2: *const ISC_UCHAR,
        arg3: *const ISC_UCHAR,
        arg4: ::std::os::raw::c_short,
        arg5: ::std::os::raw::c_short,
        arg6: ::std::os::raw::c_short,
        arg7: *mut ISC_BLOB_DESC,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_cancel_blob(arg1: *mut ISC_STATUS, arg2: *mut isc_blob_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_cancel_events(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut ISC_LONG,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_close_blob(arg1: *mut ISC_STATUS, arg2: *mut isc_blob_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_commit_retaining(arg1: *mut ISC_STATUS, arg2: *mut isc_tr_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_commit_transaction(arg1: *mut ISC_STATUS, arg2: *mut isc_tr_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_create_blob(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut isc_blob_handle,
        arg5: *mut ISC_QUAD,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_create_blob2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut isc_blob_handle,
        arg5: *mut ISC_QUAD,
        arg6: ::std::os::raw::c_short,
        arg7: *const ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_create_database(
        arg1: *mut ISC_STATUS,
        arg2: ::std::os::raw::c_short,
        arg3: *const ISC_SCHAR,
        arg4: *mut isc_db_handle,
        arg5: ::std::os::raw::c_short,
        arg6: *const ISC_SCHAR,
        arg7: ::std::os::raw::c_short,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_database_info(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: ::std::os::raw::c_short,
        arg4: *const ISC_SCHAR,
        arg5: ::std::os::raw::c_short,
        arg6: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_decode_date(arg1: *const ISC_QUAD, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn isc_decode_sql_date(arg1: *const ISC_DATE, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn isc_decode_sql_time(arg1: *const ISC_TIME, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn isc_decode_timestamp(arg1: *const ISC_TIMESTAMP, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn isc_detach_database(arg1: *mut ISC_STATUS_ARRAY, arg2: *mut isc_db_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_drop_database(arg1: *mut ISC_STATUS, arg2: *mut isc_db_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_allocate_statement(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_stmt_handle,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_alloc_statement2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_stmt_handle,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_describe(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_ushort,
        arg4: *mut XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_describe_bind(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_ushort,
        arg4: *mut XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_exec_immed2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *const ISC_SCHAR,
        arg6: ::std::os::raw::c_ushort,
        arg7: *const XSQLDA,
        arg8: *const XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_execute(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: *mut isc_stmt_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *const XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_execute2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: *mut isc_stmt_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *const XSQLDA,
        arg6: *const XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_execute_immediate(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *const ISC_SCHAR,
        arg6: ::std::os::raw::c_ushort,
        arg7: *const XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_fetch(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_ushort,
        arg4: *const XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_finish(arg1: *mut isc_db_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_free_statement(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_ushort,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_insert(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_ushort,
        arg4: *mut XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_prepare(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: *mut isc_stmt_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *const ISC_SCHAR,
        arg6: ::std::os::raw::c_ushort,
        arg7: *mut XSQLDA,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_set_cursor_name(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: *const ISC_SCHAR,
        arg4: ::std::os::raw::c_ushort,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_dsql_sql_info(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_stmt_handle,
        arg3: ::std::os::raw::c_short,
        arg4: *const ISC_SCHAR,
        arg5: ::std::os::raw::c_short,
        arg6: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_encode_date(arg1: *const ::std::os::raw::c_void, arg2: *mut ISC_QUAD);
}
extern "C" {
    pub fn isc_encode_sql_date(arg1: *const ::std::os::raw::c_void, arg2: *mut ISC_DATE);
}
extern "C" {
    pub fn isc_encode_sql_time(arg1: *const ::std::os::raw::c_void, arg2: *mut ISC_TIME);
}
extern "C" {
    pub fn isc_encode_timestamp(arg1: *const ::std::os::raw::c_void, arg2: *mut ISC_TIMESTAMP);
}
extern "C" {
    pub fn isc_event_block(
        arg1: *mut *mut ISC_UCHAR,
        arg2: *mut *mut ISC_UCHAR,
        arg3: ISC_USHORT,
        ...
    ) -> ISC_LONG;
}
extern "C" {
    pub fn isc_event_block_a(
        arg1: *mut *mut ISC_SCHAR,
        arg2: *mut *mut ISC_SCHAR,
        arg3: ISC_USHORT,
        arg4: *mut *mut ISC_SCHAR,
    ) -> ISC_USHORT;
}
extern "C" {
    pub fn isc_event_block_s(
        arg1: *mut *mut ISC_SCHAR,
        arg2: *mut *mut ISC_SCHAR,
        arg3: ISC_USHORT,
        arg4: *mut *mut ISC_SCHAR,
        arg5: *mut ISC_USHORT,
    );
}
extern "C" {
    pub fn isc_event_counts(
        arg1: *mut ISC_ULONG,
        arg2: ::std::os::raw::c_short,
        arg3: *mut ISC_UCHAR,
        arg4: *const ISC_UCHAR,
    );
}
extern "C" {
    pub fn isc_expand_dpb(arg1: *mut *mut ISC_SCHAR, arg2: *mut ::std::os::raw::c_short, ...);
}
extern "C" {
    pub fn isc_modify_dpb(
        arg1: *mut *mut ISC_SCHAR,
        arg2: *mut ::std::os::raw::c_short,
        arg3: ::std::os::raw::c_ushort,
        arg4: *const ISC_SCHAR,
        arg5: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isc_free(arg1: *mut ISC_SCHAR) -> ISC_LONG;
}
extern "C" {
    pub fn isc_get_segment(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_blob_handle,
        arg3: *mut ::std::os::raw::c_ushort,
        arg4: ::std::os::raw::c_ushort,
        arg5: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_get_slice(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut ISC_QUAD,
        arg5: ::std::os::raw::c_short,
        arg6: *const ISC_SCHAR,
        arg7: ::std::os::raw::c_short,
        arg8: *const ISC_LONG,
        arg9: ISC_LONG,
        arg10: *mut ::std::os::raw::c_void,
        arg11: *mut ISC_LONG,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_interprete(arg1: *mut ISC_SCHAR, arg2: *mut *mut ISC_STATUS_ARRAY) -> ISC_LONG;
}
extern "C" {
    pub fn fb_interpret(
        arg1: *mut ISC_SCHAR,
        arg2: ::std::os::raw::c_uint,
        arg3: *mut *mut ISC_STATUS_ARRAY,
    ) -> ISC_LONG;
}
extern "C" {
    pub fn isc_open_blob(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut isc_blob_handle,
        arg5: *mut ISC_QUAD,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_open_blob2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut isc_blob_handle,
        arg5: *mut ISC_QUAD,
        arg6: ISC_USHORT,
        arg7: *const ISC_UCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_prepare_transaction2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: ISC_USHORT,
        arg4: *const ISC_UCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_print_sqlerror(arg1: ISC_SHORT, arg2: *const ISC_STATUS);
}
extern "C" {
    pub fn isc_print_status(arg1: *const ISC_STATUS_ARRAY) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_put_segment(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_blob_handle,
        arg3: ::std::os::raw::c_ushort,
        arg4: *const ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_put_slice(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: *mut ISC_QUAD,
        arg5: ::std::os::raw::c_short,
        arg6: *const ISC_SCHAR,
        arg7: ::std::os::raw::c_short,
        arg8: *const ISC_LONG,
        arg9: ISC_LONG,
        arg10: *mut ::std::os::raw::c_void,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_que_events(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut ISC_LONG,
        arg4: ::std::os::raw::c_short,
        arg5: *const ISC_UCHAR,
        arg6: ISC_EVENT_CALLBACK,
        arg7: *mut ::std::os::raw::c_void,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_rollback_retaining(arg1: *mut ISC_STATUS, arg2: *mut isc_tr_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_rollback_transaction(arg1: *mut ISC_STATUS, arg2: *mut isc_tr_handle) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_start_multiple(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: ::std::os::raw::c_short,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_start_transaction(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: ::std::os::raw::c_short,
        ...
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn fb_disconnect_transaction(arg1: *mut ISC_STATUS, arg2: *mut isc_tr_handle)
        -> ISC_STATUS;
}
extern "C" {
    pub fn isc_sqlcode(arg1: *const ISC_STATUS_ARRAY) -> ISC_LONG;
}
extern "C" {
    pub fn isc_sqlcode_s(arg1: *const ISC_STATUS, arg2: *mut ISC_ULONG);
}
extern "C" {
    pub fn fb_sqlstate(arg1: *mut ::std::os::raw::c_char, arg2: *const ISC_STATUS);
}
extern "C" {
    pub fn isc_sql_interprete(
        arg1: ::std::os::raw::c_short,
        arg2: *mut ISC_SCHAR,
        arg3: ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn isc_transaction_info(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_tr_handle,
        arg3: ::std::os::raw::c_short,
        arg4: *const ISC_SCHAR,
        arg5: ::std::os::raw::c_short,
        arg6: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_transact_request(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_tr_handle,
        arg4: ::std::os::raw::c_ushort,
        arg5: *mut ISC_SCHAR,
        arg6: ::std::os::raw::c_ushort,
        arg7: *mut ISC_SCHAR,
        arg8: ::std::os::raw::c_ushort,
        arg9: *mut ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_vax_integer(arg1: *const ISC_SCHAR, arg2: ::std::os::raw::c_short) -> ISC_LONG;
}
extern "C" {
    pub fn isc_portable_integer(arg1: *const ISC_UCHAR, arg2: ::std::os::raw::c_short)
        -> ISC_INT64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct USER_SEC_DATA {
    pub sec_flags: ::std::os::raw::c_short,
    pub uid: ::std::os::raw::c_int,
    pub gid: ::std::os::raw::c_int,
    pub protocol: ::std::os::raw::c_int,
    pub server: *mut ISC_SCHAR,
    pub user_name: *mut ISC_SCHAR,
    pub password: *mut ISC_SCHAR,
    pub group_name: *mut ISC_SCHAR,
    pub first_name: *mut ISC_SCHAR,
    pub middle_name: *mut ISC_SCHAR,
    pub last_name: *mut ISC_SCHAR,
    pub dba_user_name: *mut ISC_SCHAR,
    pub dba_password: *mut ISC_SCHAR,
}
#[test]
fn bindgen_test_layout_USER_SEC_DATA() {
    assert_eq!(
        ::std::mem::size_of::<USER_SEC_DATA>(),
        88usize,
        concat!("Size of: ", stringify!(USER_SEC_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<USER_SEC_DATA>(),
        8usize,
        concat!("Alignment of ", stringify!(USER_SEC_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).sec_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(sec_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).uid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).gid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).protocol as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(protocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).server as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).user_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(user_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).password as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).group_name as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(group_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).first_name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(first_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).middle_name as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(middle_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).last_name as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(last_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).dba_user_name as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(dba_user_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<USER_SEC_DATA>())).dba_password as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(USER_SEC_DATA),
            "::",
            stringify!(dba_password)
        )
    );
}
extern "C" {
    pub fn isc_add_user(arg1: *mut ISC_STATUS, arg2: *const USER_SEC_DATA) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_delete_user(arg1: *mut ISC_STATUS, arg2: *const USER_SEC_DATA) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_modify_user(arg1: *mut ISC_STATUS, arg2: *const USER_SEC_DATA) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_compile_request(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_req_handle,
        arg4: ::std::os::raw::c_short,
        arg5: *const ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_compile_request2(
        arg1: *mut ISC_STATUS,
        arg2: *mut isc_db_handle,
        arg3: *mut isc_req_handle,
        arg4: ::std::os::raw::c_short,
        arg5: *const ISC_SCHAR,
    ) -> ISC_STATUS;
}
extern "C" {
    pub fn isc_ddl(
        arg1: *mut ISC_STATUS,
